app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
    end

      #makes the list of movies for the site to display
      @movies = Movie.find_all_by_rating(@ratings_array, :order => session[:sort_param])